## Dot product exercise

In [1]:
import numpy as np
import pandas as pd

In [2]:
months = ["Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug"]

In [3]:
products = ["Ice cream", "Yoghurt", "Apple pie"]

In [4]:
colnames = np.array(months)
rownames = np.array(products)

In [40]:
np.random.seed(1)
sold_products_data = np.random.randint(20, size=(len(products),len(months)))
sold_products_data

array([[ 5, 11, 12,  8,  9, 11,  5, 15],
       [ 0, 16,  1, 12,  7, 13,  6, 18],
       [ 5, 18, 11, 10, 14, 18,  4,  9]])

In [41]:
sold_products_data_frame = pd.DataFrame(data=sold_products_data,columns=colnames,index=rownames)
sold_products_data_frame

           Jan  Feb  Mar  Apr  May  Jun  Jul  Aug
Ice cream    5   11   12    8    9   11    5   15
Yoghurt      0   16    1   12    7   13    6   18
Apple pie    5   18   11   10   14   18    4    9

In [42]:
product_prices_data = np.array([15, 10, 17])
product_prices_data = product_prices_data.reshape(1,3)
product_prices_data.shape

(1, 3)

In [52]:
product_prices_data_frame = pd.DataFrame(data=product_prices_data,index=np.array(["Price"]),columns=products)
product_prices_data_frame

       Ice cream  Yoghurt  Apple pie
Price         15       10         17

In [53]:
product_prices_data_frame.T.shape, sold_products_data_frame.shape

((3, 1), (3, 8))

In [54]:
dot_product = product_prices_data_frame.dot(sold_products_data_frame)
dot_product

       Jan  Feb  Mar  Apr  May  Jun  Jul  Aug
Price  160  631  377  410  443  601  203  558